KanatERPSukhova.КанатАдаптация/src/Enums/ВариантыПредставленияНаборовВПечатныхФормах/ВариантыПредставленияНаборовВПечатныхФормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b79525ad-81e5-4ab3-8c59-e091ffe0a29d">
  <name>ВариантыПредставленияНаборовВПечатныхФормах</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="21b695cb-00f3-400b-b0e7-972bd8e2533f">
    <name>ТолькоНабор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0f2a8624-5799-402f-97ba-02cdf4c72be8">
    <name>ТолькоКомплектующие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="686f485c-ddca-4f46-aef3-d47c949caecc">
    <name>НаборИКомплектующие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Enums/ВариантыРасчетаЦенНаборов/ВариантыРасчетаЦенНаборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a9f357e7-d8a1-41d9-8e8c-998aba7763d9">
  <name>ВариантыРасчетаЦенНаборов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="95ffa208-4f6c-4263-a3c2-f5da92f7a1cd">
    <name>РассчитываетсяИзЦенКомплектующих</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3397ef23-61b6-4d41-9c81-5d406f66703f">
    <name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="299a1f71-e30b-4908-8487-03a62b1c6d26">
    <name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/CommonModules/КоммерческиеПредложенияДокументыПереопределяемый/Module.bsl
//&Вместо("ПриВыводеСтрокиТоварыПечатнуюФорму")
//Процедура КАНАТ_ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент, СтрокаТовары, ОбластьСтрокаТаблицыТовары, ИменованнаяОбластьСтрокаТовары, ДополнительныеПараметрыВывода, СтандартнаяОбработка)
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНаборы") Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	СтандартнаяОбработка = Ложь;
//	
//	Если ДополнительныеПараметрыВывода = Неопределено Тогда
//		 ДополнительныеПараметрыВывода = Новый Структура;
//	КонецЕсли;
//	
//	Если НЕ ДополнительныеПараметрыВывода.Свойство("НомерСтроки")  Тогда
//		 ДополнительныеПараметрыВывода.Вставить("НомерСтроки", 0);
//	КонецЕсли;
//	
//	Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, Истина) Тогда
//		
//		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
//			
//			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
//			
//				ДанныеСтроки = Новый Структура;
//				ДанныеСтроки.Вставить("НомерСтроки",      "");
//				ДанныеСтроки.Вставить("Номенклатура",     "");
//				ДанныеСтроки.Вставить("Количество",       "");
//				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
//				ДанныеСтроки.Вставить("СрокПоставки",     "");
//				ДанныеСтроки.Вставить("Цена",             "");
//				ДанныеСтроки.Вставить("СуммаСкидки",      "");
//				ДанныеСтроки.Вставить("СуммаСНДС",        "");
//				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
//				ДанныеСтроки.Вставить("Сумма",            "");
//				ДанныеСтроки.Вставить("СуммаНДС",         "");
//			    //·--·Гурьев·21.08.23
//			
//				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
//				ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = СтрокаТовары.Номенклатура;
//				
//			Иначе
//				
//				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//				
//			КонецЕсли;
//			
//		Иначе
//			
//			ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
//			ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
//			
//		КонецЕсли;
//		
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
//		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
//		
//	ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, Истина) Тогда
//		
//		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
//		
//		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
//			
//			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
//				
//				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//				
//			Иначе
//				
//				ДанныеСтроки = Новый Структура;
//				ДанныеСтроки.Вставить("НомерСтроки",      "");
//				ДанныеСтроки.Вставить("Номенклатура",     "");
//				ДанныеСтроки.Вставить("Количество",       "");
//				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
//				ДанныеСтроки.Вставить("СрокПоставки",     "");
//				ДанныеСтроки.Вставить("Цена",             "");
//				ДанныеСтроки.Вставить("СуммаСкидки",      "");
//				ДанныеСтроки.Вставить("СуммаСНДС",        "");
//				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
//				ДанныеСтроки.Вставить("Сумма",            "");
//				ДанныеСтроки.Вставить("СуммаНДС",         "");
//			    //·--·Гурьев·21.08.23
//				
//				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
//				СтрокаТовары.Номенклатура = СтрШаблон(НСтр("ru = '%1, %2 %3';
//															|en = '%1, %2 %3'"), СтрокаТовары.Номенклатура, СтрокаТовары.Количество, СтрокаТовары.ЕдиницаИзмерения);
//				
//			КонецЕсли;
//			
//		Иначе
//			
//			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//			
//		КонецЕсли;
//		
//		ПараметрыОбласти = ОбластьСтрокаТаблицыТовары.Параметры; // ПараметрыМакетаТабличногоДокумента
//		ПараметрыОбласти.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
//		ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = " - " + СтрокаТовары.Номенклатура;
//		
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
//		
//		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
//		
//	Иначе
//		
//		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
//		
//		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
//		ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
//		
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
//		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
//		
//		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
//		
//		Возврат;
//		
//	КонецЕсли;
//КонецПроцедуры

&ИзменениеИКонтроль("ПриВыводеСтрокиТоварыПечатнуюФорму")
Процедура КАНАТ_ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент, СтрокаТовары, ОбластьСтрокаТаблицыТовары, ИменованнаяОбластьСтрокаТовары, ДополнительныеПараметрыВывода, СтандартнаяОбработка)
    #Удаление
	КоммерческиеПредложенияДокументыУТ.ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент, 
	СтрокаТовары, 
	ОбластьСтрокаТаблицыТовары, 
	ИменованнаяОбластьСтрокаТовары, 
	ДополнительныеПараметрыВывода, 
	СтандартнаяОбработка);
 	#КонецУдаления
	#Вставка    
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНаборы") Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ДополнительныеПараметрыВывода = Неопределено Тогда
		 ДополнительныеПараметрыВывода = Новый Структура;
	КонецЕсли;
	
	Если НЕ ДополнительныеПараметрыВывода.Свойство("НомерСтроки")  Тогда
		 ДополнительныеПараметрыВывода.Вставить("НомерСтроки", 0);
	КонецЕсли;
	
	Если НаборыСервер.ИспользоватьОбластьНабор(СтрокаТовары, Истина) Тогда
		
		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
			
			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
			
				ДанныеСтроки = Новый Структура;
				ДанныеСтроки.Вставить("НомерСтроки",      "");
				ДанныеСтроки.Вставить("Номенклатура",     "");
				ДанныеСтроки.Вставить("Количество",       "");
				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
				ДанныеСтроки.Вставить("СрокПоставки",     "");
				ДанныеСтроки.Вставить("Цена",             "");
				ДанныеСтроки.Вставить("СуммаСкидки",      "");
				ДанныеСтроки.Вставить("СуммаСНДС",        "");
				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
				ДанныеСтроки.Вставить("Сумма",            "");
				ДанныеСтроки.Вставить("СуммаНДС",         "");
			    //·--·Гурьев·21.08.23
			
				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
				ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = СтрокаТовары.Номенклатура;
				
			Иначе
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
				
			КонецЕсли;
			
		Иначе
			
			ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
			ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
			
		КонецЕсли;
		
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		
	ИначеЕсли НаборыСервер.ИспользоватьОбластьКомплектующие(СтрокаТовары, Истина) Тогда
		
		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
		
		Если СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие Тогда
			
			Если СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих Тогда
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
				
			Иначе
				
				ДанныеСтроки = Новый Структура;
				ДанныеСтроки.Вставить("НомерСтроки",      "");
				ДанныеСтроки.Вставить("Номенклатура",     "");
				ДанныеСтроки.Вставить("Количество",       "");
				ДанныеСтроки.Вставить("ЕдиницаИзмерения", "");
				ДанныеСтроки.Вставить("СрокПоставки",     "");
				ДанныеСтроки.Вставить("Цена",             "");
				ДанныеСтроки.Вставить("СуммаСкидки",      "");
				ДанныеСтроки.Вставить("СуммаСНДС",        "");
				//·++·Гурьев·21.08.23·#2.9·Заполнение новых столбцов таблицы
				ДанныеСтроки.Вставить("Сумма",            "");
				ДанныеСтроки.Вставить("СуммаНДС",         "");
			    //·--·Гурьев·21.08.23
				
				ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(ДанныеСтроки);
				СтрокаТовары.Номенклатура = СтрШаблон(НСтр("ru = '%1, %2 %3';
															|en = '%1, %2 %3'"), СтрокаТовары.Номенклатура, СтрокаТовары.Количество, СтрокаТовары.ЕдиницаИзмерения);
				
			КонецЕсли;
			
		Иначе
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
			
		КонецЕсли;
		
		ПараметрыОбласти = ОбластьСтрокаТаблицыТовары.Параметры; // ПараметрыМакетаТабличногоДокумента
		ПараметрыОбласти.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
		ОбластьСтрокаТаблицыТовары.Параметры.Номенклатура = " - " + СтрокаТовары.Номенклатура;
		
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		
	Иначе
		
		ДополнительныеПараметрыВывода.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки + 1;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицыТовары.Параметры, СтрокаТовары);
		ОбластьСтрокаТаблицыТовары.Параметры.НомерСтроки = ДополнительныеПараметрыВывода.НомерСтроки;
		
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
		ОбластьСтрокаТаблицыТовары.Области[ИменованнаяОбластьСтрокаТовары].ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1, 0);
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		
		Возврат;
		
	КонецЕсли;
	#КонецВставки
КонецПроцедуры
